In [10]:
import pandas as pd
df=pd.read_csv("C:/Users/User/Desktop/국영수2.csv", encoding="cp949")

In [11]:
df.shape

(9, 4)

In [12]:
df.columns

Index(['국어', '영어', '수학', '체육'], dtype='object')

In [13]:
df.dtypes

국어    float64
영어      int64
수학    float64
체육     object
dtype: object

In [14]:
df.describe()

              국어         영어         수학
count   8.000000   9.000000   8.000000
mean   67.375000  65.666667  52.875000
std    18.054976  25.729361  30.554109
min    41.000000  22.000000  13.000000
25%    53.000000  47.000000  21.000000
50%    69.000000  65.000000  59.500000
75%    84.250000  87.000000  79.500000
max    87.000000  98.000000  87.000000

In [15]:
df.head()

     국어  영어    수학 체육
0  50.0  88  21.0  상
1  41.0  87  54.0  중
2  85.0  65  84.0  상
3  61.0  85  13.0  중
4  54.0  41  21.0  하

In [16]:
df.tail()

     국어  영어    수학 체육
4  54.0  41  21.0  하
5  84.0  47  87.0  하
6  77.0  98  65.0  상
7  87.0  58   NaN  중
8   NaN  22  78.0  하

In [17]:
df.isnull().sum()

국어    1
영어    0
수학    1
체육    0
dtype: int64

In [18]:
df["체육"].value_counts()
# 여기까지가 데이터 불러오고 나서 무조건
# 이 작업까지 해서 데이터를 파악하는 과정이다

체육
상    3
중    3
하    3
Name: count, dtype: int64

In [19]:
df["체육"].unique()

array(['상', '중', '하'], dtype=object)

In [20]:
df["체육"].nunique()

3

In [21]:
df=pd.read_csv("C:/Users/User/Desktop/국영수.csv", encoding='cp949')

In [23]:
# 방법 1. 하나의 변수 추출
df["체육"]

0    상
1    중
2    상
3    중
4    하
5    하
6    상
7    중
8    하
Name: 체육, dtype: object

In [24]:
# 새로운 열 생성
df["total"] = df["수학"] + df["영어"]

In [26]:
print(df)

   국어  영어  수학 체육  total
0  50  88  21  상    109
1  41  87  54  중    141
2  85  65  84  상    149
3  61  85  13  중     98
4  54  41  21  하     62
5  84  47  87  하    134
6  77  98  65  상    163
7  87  58  54  중    112
8  54  22  78  하    100

In [29]:
columns = [df['수학'], df['영어']]

In [30]:
columns

[0    21
 1    54
 2    84
 3    13
 4    21
 5    87
 6    65
 7    54
 8    78
 Name: 수학, dtype: int64,
 0    88
 1    87
 2    65
 3    85
 4    41
 5    47
 6    98
 7    58
 8    22
 Name: 영어, dtype: int64]

In [31]:
# 방법 2

In [39]:
# loc: 변수명을 입력
df.loc[:, "체육"]

0    상
1    중
2    상
3    중
4    하
5    하
6    상
7    중
8    하
Name: 체육, dtype: object

In [41]:
# iloc: 변수위치를 입력 int locatcion의 약자
# 0번째 열: 국어, 1번째 열: 영어, 2번째 열: 수학, 3번재 열: 체육
df.iloc[:,3]

0    상
1    중
2    상
3    중
4    하
5    하
6    상
7    중
8    하
Name: 체육, dtype: object

In [44]:
# 두개 이상의 변수 추출 시 리스트로 변수를 추출
df.iloc[:,[0,1,2]]

   국어  영어  수학
0  50  88  21
1  41  87  54
2  85  65  84
3  61  85  13
4  54  41  21
5  84  47  87
6  77  98  65
7  87  58  54
8  54  22  78

In [51]:
# 리스트인덱싱과 유사함
df["체육"][:4]

0    상
1    중
2    상
3    중
Name: 체육, dtype: object